def min_population_density(country_data):
    min_density = float('inf')  # Ініціалізуємо мінімальну щільність населення як нескінченність
    min_density_country = None  # Ініціалізуємо змінну для назви країни з мінімальною щільністю населення

    for country, population, area in country_data:
        density = population / area  # Обчислюємо щільність населення для поточної країни

        if density < min_density:  # Перевіряємо, чи щільність населення поточної країни менше за мінімальну
            min_density = density  # Якщо так, оновлюємо мінімальну щільність населення
            min_density_country = country  # І назву країни з мінімальною щільністю населення

    return min_density_country  # Повертаємо назву країни з мінімальною щільністю населення


# Задання даних про країни (назва, населення у мільйонах, площа у тисячах квадратних км)
country_data = [
    ("Україна", 44.4, 603.5),
    ("США", 331.4, 9833.5),
    ("Індія", 1380, 3287),
    ("Китай", 1444, 9597),
    ("Бразилія", 213.8, 8515),
    ("Німеччина", 83.2, 357),
    ("Пакистан", 220.9, 881.9),
    ("Нігерія", 206.1, 923.8),
    ("Бангладеш", 163, 147),
    ("Японія", 126.8, 377),
    ("Мексика", 126.2, 1964),
    ("Філіппіни", 108.1, 300),
    ("Ефіопія", 117.9, 114.4),
    ("Єгипет", 104.3, 1000)]

# Викликаємо функцію та виводимо результат
result_country = min_population_density(country_data)
print("Країна з мінімальною щільністю населення:", result_country)
